#include "global.h"
#include "modding.h"

#include "apcommon.h"

#define LOCATION_BEAVER_BOTTLE 0x09018D
#define LOCATION_BEAVER_HP 0x07018D

// #include "overlays/actors/ovl_En_Fish/z_en_fish.h"
#include "overlays/actors/ovl_En_Twig/z_en_twig.h"

#define FLAGS (ACTOR_FLAG_10 | ACTOR_FLAG_80000000)
#define THIS ((EnAz*)thisx)

struct EnAz;

typedef void (*EnAzActionFunc)(struct EnAz*, PlayState*);

#define BEAVER_GET_PARAM_F00(thisx) (((thisx)->params >> 8) & 0xF)
#define BEAVER_GET_PARAM_FF(thisx) ((thisx)->params & 0xFF)

#define BEAVER_OLDER_BROTHER_LIMB_MAX 0x18

typedef struct EnAz {
    /* 0x000 */ Actor actor;
    /* 0x144 */ EnAzActionFunc actionFunc;
    /* 0x148 */ SkelAnime skelAnime;
    /* 0x18C */ ColliderCylinder collider;
    /* 0x1D8 */ Vec3s jointTable[BEAVER_OLDER_BROTHER_LIMB_MAX]; // Also BEAVER_YOUNGER_BROTHER_LIMB_MAX
    /* 0x268 */ Vec3s morphTable[BEAVER_OLDER_BROTHER_LIMB_MAX]; // Also BEAVER_YOUNGER_BROTHER_LIMB_MAX
    /* 0x2F8 */ s16 unk_2F8;
    /* 0x2FA */ s16 unk_2FA; // cutscene state?
    /* 0x2FC */ s32 animIndex;
    /* 0x300 */ ActorPathing unk_300;
    /* 0x36C */ f32 unk_36C;
    /* 0x370 */ UNK_TYPE1 unk370[4];
    /* 0x374 */ u16 unk_374; // flags of some sort
    /* 0x376 */ u16 unk_376; // flags of some sort
    /* 0x378 */ u8 unk_378; // cutscene state?
    /* 0x37A */ s16 unk_37A;
    /* 0x37C */ s16 unk_37C;
    /* 0x37E */ s16 unk_37E;
    /* 0x380 */ s16 unk_380;
    /* 0x382 */ s16 unk_382;
    /* 0x384 */ s16 unk_384;
    /* 0x388 */ struct EnAz* brother;
    /* 0x38C */ UNK_TYPE1 unk38C[0x10];
    /* 0x39C */ s16 unk_39C;
    /* 0x39E */ s16 unk_39E; // some sort of rotation
    /* 0x3A0 */ UNK_TYPE1 unk3A0[4];
    /* 0x3A4 */ f32 unk_3A4;
    /* 0x3A8 */ Vec3f unk_3A8;
    /* 0x3B4 */ Vec3f unk_3B4; // translation 
    /* 0x3C0 */ s16 unk_3C0; // seems to do nothing
    /* 0x3C2 */ s16 unk_3C2;
    /* 0x3C4 */ s16 unk_3C4;
    /* 0x3C6 */ UNK_TYPE1 unk3C6[6];
    /* 0x3CC */ s32 getItemId;
    /* 0x3D0 */ s16 csIdList[1];
    /* 0x3D2 */ u16 unk_3D2;
    /* 0x3D4 */ s16 unk_3D4;
    /* 0x3D6 */ s16 unk_3D6;
} EnAz; // size = 0x3D8

struct EnFish;

typedef void (*EnFishUnkFunc)(Actor*, PlayState*);

typedef enum {
    /* -1 */ ENFISH_MINUS1 = -1,
    /*  0 */ ENFISH_0,
    /*  1 */ ENFISH_1,
    /*  2 */ ENFISH_2
} EnFishParam;

#define FISH_PARAMS(param) (param)

#define FISH_LIMB_MAX 0x07

typedef struct EnFish {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderJntSph collider;
    /* 0x164 */ ColliderJntSphElement colliderElements[1];
    /* 0x1A4 */ SkelAnime skelAnime;
    /* 0x1E8 */ Vec3s jointTable[FISH_LIMB_MAX];
    /* 0x212 */ Vec3s morphTable[FISH_LIMB_MAX];
    /* 0x23C */ EnFishUnkFunc unkFunc;
    /* 0x240 */ s16 unk_240;
    /* 0x242 */ s16 unk_242;
    /* 0x244 */ s16 unk_244;
    /* 0x246 */ s16 unk_246;
    /* 0x248 */ s32 updBgCheckInfoFlags;
    /* 0x24C */ f32 unk_24C;
    /* 0x250 */ f32 unk_250;
    /* 0x254 */ f32 unk_254;
    /* 0x258 */ f32 unk_258;
    /* 0x25C */ f32 unk_25C;
    /* 0x260 */ f32 unk_260;
    /* 0x264 */ s16 unk_264;
    /* 0x266 */ s16 unk_266;
    /* 0x268 */ s16 unk_268;
    /* 0x26A */ s16 unk_26A;
    /* 0x26C */ s16 unk_26C;
    /* 0x26E */ s16 unk_26E;
    /* 0x270 */ s16 unk_270;
    /* 0x272 */ s16 unk_272;
    /* 0x274 */ s16 unk_274;
    /* 0x276 */ s8 unk_276;
    /* 0x277 */ u8 unk_277;
    /* 0x278 */ s8 unk_278;
    /* 0x279 */ s8 unk_279;
} EnFish; // size = 0x27C

typedef enum {
    BEAVER_ANIM_NONE = -1,
    BEAVER_ANIM_IDLE,
    BEAVER_ANIM_WALK,
    BEAVER_ANIM_SWIM_WITH_SPINNING_TAIL,
    BEAVER_ANIM_SWIM_WITH_RAISED_TAIL,
    BEAVER_ANIM_TALK,
    BEAVER_ANIM_TALK_WAVE_ARMS,
    BEAVER_ANIM_LAUGH_RIGHT,
    BEAVER_ANIM_LAUGH_LEFT,
    BEAVER_ANIM_SWIM,
    BEAVER_ANIM_TALK_TO_LEFT,
    BEAVER_ANIM_TALK_TO_RIGHT,
    BEAVER_ANIM_BOW,
    BEAVER_ANIM_IDLE_FACE_LEFT,
    BEAVER_ANIM_IDLE_FACE_RIGHT,
    BEAVER_ANIM_IDLE_FACE_MAX
} BeaverAnimation;

extern Vec3f D_80A99E80;
extern f32 D_80A99E8C;
// extern AnimationSpeedInfo sAnimationSpeedInfo[BEAVER_ANIM_IDLE_FACE_MAX];
extern AnimationSpeedInfo D_80AEF868[BEAVER_ANIM_IDLE_FACE_MAX];

void func_80A982E0(PlayState *play, ActorPathing *actorPathing);
void func_80A98414(EnAz *this, PlayState *play);
void func_80A98EFC(EnAz *this, PlayState *play, u16 textId, s32 animIndex, s32 brotherAnimIndex);
